---------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\hp\Documents\thesis\Ghana_2019_MIS_analysis_pro
> ject\data\01_w_mal.log
  log type:  text
 opened on:   6 May 2021, 11:55:48

. 
. //Date: 5th May, 2021 last log "01_w_mal.log"
. 
. //check v220 ever married
. gen wgt=v005/100000
variable wgt already defined
r(110);

end of do-file

r(110);

. do "C:\Users\hp\Documents\thesis\Ghana_2019_MIS_analysis_project\da
> ta\01_women_mal.do"

. use "C:\Users\hp\Documents\thesis\Ghana_2019_MIS_analysis_project\d
> ata\women_malaria.dta"

. 
. log using "01_w_mal.log",append
log file already open
r(604);

end of do-file

r(604);

. do "C:\Users\hp\AppData\Local\Temp\STD308c_000000.tmp"

. svyset v021 [pw=wgt],strata(v023)

      pweight: wgt
          VCE: linearized
  Single unit: missing
     Strata 1: v023
         SU 1: v021
        FPC 1: <zero>

. 
end of do-file

. do "C:\Users\hp\AppData\Local\Temp\STD308c_000000.tmp"

. gen Living_Children=(v219 != 0)
variable Living_Children already defined
r(110);

end of do-file

r(110);

. drop Living_Children

. do "C:\Users\hp\AppData\Local\Temp\STD308c_000000.tmp"

. gen Living_Children=(v219 != 0)

. 
end of do-file

. br v219 Living_Children

. do "C:\Users\hp\AppData\Local\Temp\STD308c_000000.tmp"

. label define bi 0 "No" 1 "Yes"

. 
end of do-file

. do "C:\Users\hp\AppData\Local\Temp\STD308c_000000.tmp"

. label values Living_Children bi

. 
end of do-file

. svy:mean s501, over(v024)
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =      20          Number of obs   =      5,181
Number of PSUs   =     200          Population size = 51,809.999
                                    Design df       =        180

----------------------------------------------------------------
               |             Linearized
               |       Mean   Std. Err.     [95% Conf. Interval]
---------------+------------------------------------------------
   c.s501@v024 |
      western  |    .596746   .0347934      .5280905    .6654014
      central  |   .5447055   .0450784      .4557554    .6336557
greater accra  |   .7068247    .039871        .62815    .7854994
        volta  |   .5881952   .0602732      .4692623    .7071282
      eastern  |   .5321626    .031317       .470367    .5939583
      ashanti  |   .6370393   .0345492      .5688657    .7052129
  brong ahafo  |   .5037786   .0277685      .4489849    .5585723
     northern  |   .4948388   .0357729      .4242506    .5654269
   upper east  |   .5607233   .0228096      .5157147     .605732
   upper west  |   .4485579    .027159      .3949669    .5021488
----------------------------------------------------------------

. svy:tab v024 s501, percent
(running tabulate on estimation sample)

Number of strata   =        20                  Number of obs     =  
>     5,181
Number of PSUs     =       200                  Population size   = 5
> 1,809.999
                                                Design df         =  
>       180

-------------------------------
          |  seen or heard any 
          |   messages about   
          |  malaria in past 6 
          |       months       
   region |    no    yes  Total
----------+--------------------
  western | 3.901  5.773  9.674
  central | 3.238  3.874  7.111
  greater | 5.308   12.8   18.1
    volta | 4.462  6.373  10.84
  eastern | 5.798  6.595  12.39
  ashanti | 6.658  11.69  18.34
 brong ah | 3.618  3.673  7.291
 northern | 4.695  4.599  9.293
 upper ea | 1.819  2.321   4.14
 upper we | 1.552  1.262  2.814
          | 
    Total | 41.05  58.95    100
-------------------------------
  Key:  cell percentage

  Pearson:
    Uncorrected   chi2(9)         =  116.1283
    Design-based  F(5.72, 1029.33)=    4.0062     P = 0.0007

. svy:mean s512, over(v024)
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =      20          Number of obs   =      5,181
Number of PSUs   =     200          Population size = 51,809.999
                                    Design df       =        180

----------------------------------------------------------------
               |             Linearized
               |       Mean   Std. Err.     [95% Conf. Interval]
---------------+------------------------------------------------
   c.s512@v024 |
      western  |   1.129812   .0926493      .9469939    1.312631
      central  |   1.089032   .0537708      .9829297    1.195134
greater accra  |   1.544137   .0855438      1.375339    1.712934
        volta  |   1.114541     .05562       1.00479    1.224292
      eastern  |   1.155158   .0760296      1.005134    1.305182
      ashanti  |   1.028967   .0386991      .9526053     1.10533
  brong ahafo  |   1.037214   .0410496      .9562139    1.118214
     northern  |   1.059526   .0391349      .9823043    1.136749
   upper east  |   .9823728   .0297174      .9237335    1.041012
   upper west  |   .9497053   .0343177      .8819886    1.017422
----------------------------------------------------------------

. svy:mean s501, over(v024)
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =      20          Number of obs   =      5,181
Number of PSUs   =     200          Population size = 51,809.999
                                    Design df       =        180

----------------------------------------------------------------
               |             Linearized
               |       Mean   Std. Err.     [95% Conf. Interval]
---------------+------------------------------------------------
   c.s501@v024 |
      western  |    .596746   .0347934      .5280905    .6654014
      central  |   .5447055   .0450784      .4557554    .6336557
greater accra  |   .7068247    .039871        .62815    .7854994
        volta  |   .5881952   .0602732      .4692623    .7071282
      eastern  |   .5321626    .031317       .470367    .5939583
      ashanti  |   .6370393   .0345492      .5688657    .7052129
  brong ahafo  |   .5037786   .0277685      .4489849    .5585723
     northern  |   .4948388   .0357729      .4242506    .5654269
   upper east  |   .5607233   .0228096      .5157147     .605732
   upper west  |   .4485579    .027159      .3949669    .5021488
----------------------------------------------------------------

. svy:mean s512, over(v024)
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =      20          Number of obs   =      5,181
Number of PSUs   =     200          Population size = 51,809.999
                                    Design df       =        180

----------------------------------------------------------------
               |             Linearized
               |       Mean   Std. Err.     [95% Conf. Interval]
---------------+------------------------------------------------
   c.s512@v024 |
      western  |   1.129812   .0926493      .9469939    1.312631
      central  |   1.089032   .0537708      .9829297    1.195134
greater accra  |   1.544137   .0855438      1.375339    1.712934
        volta  |   1.114541     .05562       1.00479    1.224292
      eastern  |   1.155158   .0760296      1.005134    1.305182
      ashanti  |   1.028967   .0386991      .9526053     1.10533
  brong ahafo  |   1.037214   .0410496      .9562139    1.118214
     northern  |   1.059526   .0391349      .9823043    1.136749
   upper east  |   .9823728   .0297174      .9237335    1.041012
   upper west  |   .9497053   .0343177      .8819886    1.017422
----------------------------------------------------------------

. svy:tab v024 s512, percent
(running tabulate on estimation sample)

Number of strata   =        20                  Number of obs     =  
>     5,181
Number of PSUs     =       200                  Population size   = 5
> 1,809.999
                                                Design df         =  
>       180

--------------------------------------------------
          |  allow child to be vaccinated against 
          |                malaria                
   region |       no       yes  don't kn     Total
----------+---------------------------------------
  western |    .7435     8.645     .2856     9.674
  central |    .4188     6.542     .1503     7.111
  greater |    1.476     15.01     1.618      18.1
    volta |    1.267      9.21     .3583     10.84
  eastern |    .8731     11.12     .3994     12.39
  ashanti |    .6128     17.57     .1635     18.34
 brong ah |    .1847     7.041     .0651     7.291
 northern |    .3857     8.773     .1341     9.293
 upper ea |    .3059     3.801     .0333      4.14
 upper we |    .2425     2.557     .0144     2.814
          | 
    Total |     6.51     90.27     3.222       100
--------------------------------------------------
  Key:  cell percentage

  Pearson:
    Uncorrected   chi2(18)        =  202.1814
    Design-based  F(13.51, 2431.65)=    7.1303    P = 0.0000

. svy:tab s512, percent
(running tabulate on estimation sample)

Number of strata   =        20                  Number of obs     =  
>     5,181
Number of PSUs     =       200                  Population size   = 5
> 1,809.999
                                                Design df         =  
>       180

----------------------
allow     |
child to  |
be        |
vaccinate |
d against |
malaria   | percentage
----------+-----------
       no |       6.51
      yes |      90.27
 don't kn |      3.222
          | 
    Total |        100
----------------------
  Key:  percentage  =  cell percentage

. svy:tab s512, nolab'
(running tabulate on estimation sample)
option ' not allowed
r(198);

. svy:tab s512, nolab
(running tabulate on estimation sample)

Number of strata   =        20                  Number of obs     =  
>     5,181
Number of PSUs     =       200                  Population size   = 5
> 1,809.999
                                                Design df         =  
>       180

----------------------
     s512 | proportion
----------+-----------
        0 |      .0651
        1 |      .9027
        8 |      .0322
          | 
    Total |          1
----------------------
  Key:  proportion  =  cell proportion

. svy:tab v024 s512, percent
(running tabulate on estimation sample)

Number of strata   =        20                  Number of obs     =  
>     5,181
Number of PSUs     =       200                  Population size   = 5
> 1,809.999
                                                Design df         =  
>       180

--------------------------------------------------
          |  allow child to be vaccinated against 
          |                malaria                
   region |       no       yes  don't kn     Total
----------+---------------------------------------
  western |    .7435     8.645     .2856     9.674
  central |    .4188     6.542     .1503     7.111
  greater |    1.476     15.01     1.618      18.1
    volta |    1.267      9.21     .3583     10.84
  eastern |    .8731     11.12     .3994     12.39
  ashanti |    .6128     17.57     .1635     18.34
 brong ah |    .1847     7.041     .0651     7.291
 northern |    .3857     8.773     .1341     9.293
 upper ea |    .3059     3.801     .0333      4.14
 upper we |    .2425     2.557     .0144     2.814
          | 
    Total |     6.51     90.27     3.222       100
--------------------------------------------------
  Key:  cell percentage

  Pearson:
    Uncorrected   chi2(18)        =  202.1814
    Design-based  F(13.51, 2431.65)=    7.1303    P = 0.0000

. svy:tab v024 s501, percent
(running tabulate on estimation sample)

Number of strata   =        20                  Number of obs     =  
>     5,181
Number of PSUs     =       200                  Population size   = 5
> 1,809.999
                                                Design df         =  
>       180

-------------------------------
          |  seen or heard any 
          |   messages about   
          |  malaria in past 6 
          |       months       
   region |    no    yes  Total
----------+--------------------
  western | 3.901  5.773  9.674
  central | 3.238  3.874  7.111
  greater | 5.308   12.8   18.1
    volta | 4.462  6.373  10.84
  eastern | 5.798  6.595  12.39
  ashanti | 6.658  11.69  18.34
 brong ah | 3.618  3.673  7.291
 northern | 4.695  4.599  9.293
 upper ea | 1.819  2.321   4.14
 upper we | 1.552  1.262  2.814
          | 
    Total | 41.05  58.95    100
-------------------------------
  Key:  cell percentage

  Pearson:
    Uncorrected   chi2(9)         =  116.1283
    Design-based  F(5.72, 1029.33)=    4.0062     P = 0.0007

. do "C:\Users\hp\AppData\Local\Temp\STD308c_000000.tmp"

. recode s501 (0 8 =0 "No") (1=1 "Yes"), gen (heard_seen_mal_bi)
(0 differences between s501 and heard_seen_mal_bi)

. 
end of do-file

. svy:mean s512, over(v024)
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =      20          Number of obs   =      5,181
Number of PSUs   =     200          Population size = 51,809.999
                                    Design df       =        180

----------------------------------------------------------------
               |             Linearized
               |       Mean   Std. Err.     [95% Conf. Interval]
---------------+------------------------------------------------
   c.s512@v024 |
      western  |   1.129812   .0926493      .9469939    1.312631
      central  |   1.089032   .0537708      .9829297    1.195134
greater accra  |   1.544137   .0855438      1.375339    1.712934
        volta  |   1.114541     .05562       1.00479    1.224292
      eastern  |   1.155158   .0760296      1.005134    1.305182
      ashanti  |   1.028967   .0386991      .9526053     1.10533
  brong ahafo  |   1.037214   .0410496      .9562139    1.118214
     northern  |   1.059526   .0391349      .9823043    1.136749
   upper east  |   .9823728   .0297174      .9237335    1.041012
   upper west  |   .9497053   .0343177      .8819886    1.017422
----------------------------------------------------------------

. svy:mean heard_seen_mal_bi , over(v024)
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =      20                    Number 
> of obs                                             
>          =      5,181
Number of PSUs   =     200                    Populat
> ion size                                           
>          = 51,809.999
                                              Design 
> df                                                 
>          =        180

-----------------------------------------------------
> ---------------------
                         |             Linearized
                         |       Mean   Std. Err.    
>  [95% Con                                          
>          f. Interval]
-------------------------+---------------------------
> ---------------------
c.heard_seen_mal_bi@v024 |
                western  |    .596746   .0347934     
>  .5280905                                          
>              .6654014
                central  |   .5447055   .0450784     
>  .4557554                                          
>              .6336557
          greater accra  |   .7068247    .039871     
>    .62815                                          
>              .7854994
                  volta  |   .5881952   .0602732     
>  .4692623                                          
>              .7071282
                eastern  |   .5321626    .031317     
>   .470367                                          
>              .5939583
                ashanti  |   .6370393   .0345492     
>  .5688657                                          
>              .7052129
            brong ahafo  |   .5037786   .0277685     
>  .4489849                                          
>              .5585723
               northern  |   .4948388   .0357729     
>  .4242506                                          
>              .5654269
             upper east  |   .5607233   .0228096     
>  .5157147                                          
>               .605732
             upper west  |   .4485579    .027159     
>  .3949669                                          
>              .5021488
-----------------------------------------------------
> ---------------------

. svy:mean s512, over(v024)
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =      20          Number of obs   =      5,181
Number of PSUs   =     200          Population size = 51,809.999
                                    Design df       =        180

----------------------------------------------------------------
               |             Linearized
               |       Mean   Std. Err.     [95% Conf. Interval]
---------------+------------------------------------------------
   c.s512@v024 |
      western  |   1.129812   .0926493      .9469939    1.312631
      central  |   1.089032   .0537708      .9829297    1.195134
greater accra  |   1.544137   .0855438      1.375339    1.712934
        volta  |   1.114541     .05562       1.00479    1.224292
      eastern  |   1.155158   .0760296      1.005134    1.305182
      ashanti  |   1.028967   .0386991      .9526053     1.10533
  brong ahafo  |   1.037214   .0410496      .9562139    1.118214
     northern  |   1.059526   .0391349      .9823043    1.136749
   upper east  |   .9823728   .0297174      .9237335    1.041012
   upper west  |   .9497053   .0343177      .8819886    1.017422
----------------------------------------------------------------

. svy:mean heard_seen_mal_bi , over(v024)
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =      20                    Number of obs   =      5,181
Number of PSUs   =     200                    Population size = 51,809.999
                                              Design df       =        180

--------------------------------------------------------------------------
                         |             Linearized
                         |       Mean   Std. Err.     [95% Conf. Interval]
-------------------------+------------------------------------------------
c.heard_seen_mal_bi@v024 |
                western  |    .596746   .0347934      .5280905    .6654014
                central  |   .5447055   .0450784      .4557554    .6336557
          greater accra  |   .7068247    .039871        .62815    .7854994
                  volta  |   .5881952   .0602732      .4692623    .7071282
                eastern  |   .5321626    .031317       .470367    .5939583
                ashanti  |   .6370393   .0345492      .5688657    .7052129
            brong ahafo  |   .5037786   .0277685      .4489849    .5585723
               northern  |   .4948388   .0357729      .4242506    .5654269
             upper east  |   .5607233   .0228096      .5157147     .605732
             upper west  |   .4485579    .027159      .3949669    .5021488
--------------------------------------------------------------------------

. svy:tab v024 heard_seen_mal_bi , percent
(running tabulate on estimation sample)

Number of strata   =        20                  Number of obs     =      5,181
Number of PSUs     =       200                  Population size   = 51,809.999
                                                Design df         =        180

-------------------------------
          |RECODE of s501 (seen
          |    or heard any    
          |   messages about   
          |  malaria in past 6 
          |       months)      
   region |    No    Yes  Total
----------+--------------------
  western | 3.901  5.773  9.674
  central | 3.238  3.874  7.111
  greater | 5.308   12.8   18.1
    volta | 4.462  6.373  10.84
  eastern | 5.798  6.595  12.39
  ashanti | 6.658  11.69  18.34
 brong ah | 3.618  3.673  7.291
 northern | 4.695  4.599  9.293
 upper ea | 1.819  2.321   4.14
 upper we | 1.552  1.262  2.814
          | 
    Total | 41.05  58.95    100
-------------------------------
  Key:  cell percentage

  Pearson:
    Uncorrected   chi2(9)         =  116.1283
    Design-based  F(5.72, 1029.33)=    4.0062     P = 0.0007

. svy:tab v024 s501, percent
(running tabulate on estimation sample)

Number of strata   =        20                  Number of obs     =      5,181
Number of PSUs     =       200                  Population size   = 51,809.999
                                                Design df         =        180

-------------------------------
          |  seen or heard any 
          |   messages about   
          |  malaria in past 6 
          |       months       
   region |    no    yes  Total
----------+--------------------
  western | 3.901  5.773  9.674
  central | 3.238  3.874  7.111
  greater | 5.308   12.8   18.1
    volta | 4.462  6.373  10.84
  eastern | 5.798  6.595  12.39
  ashanti | 6.658  11.69  18.34
 brong ah | 3.618  3.673  7.291
 northern | 4.695  4.599  9.293
 upper ea | 1.819  2.321   4.14
 upper we | 1.552  1.262  2.814
          | 
    Total | 41.05  58.95    100
-------------------------------
  Key:  cell percentage

  Pearson:
    Uncorrected   chi2(9)         =  116.1283
    Design-based  F(5.72, 1029.33)=    4.0062     P = 0.0007

. drop heard_seen_mal_bi

. do "C:\Users\hp\AppData\Local\Temp\STD308c_000000.tmp"

. recode s512 (0 8 =0 "No") (1=1 "Yes"), gen (allow_mal_vaccine)
(131 differences between s512 and allow_mal_vaccine)

. 
end of do-file

. svy:mean s512, over(v024)
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =      20          Number of obs   =      5,181
Number of PSUs   =     200          Population size = 51,809.999
                                    Design df       =        180

----------------------------------------------------------------
               |             Linearized
               |       Mean   Std. Err.     [95% Conf. Interval]
---------------+------------------------------------------------
   c.s512@v024 |
      western  |   1.129812   .0926493      .9469939    1.312631
      central  |   1.089032   .0537708      .9829297    1.195134
greater accra  |   1.544137   .0855438      1.375339    1.712934
        volta  |   1.114541     .05562       1.00479    1.224292
      eastern  |   1.155158   .0760296      1.005134    1.305182
      ashanti  |   1.028967   .0386991      .9526053     1.10533
  brong ahafo  |   1.037214   .0410496      .9562139    1.118214
     northern  |   1.059526   .0391349      .9823043    1.136749
   upper east  |   .9823728   .0297174      .9237335    1.041012
   upper west  |   .9497053   .0343177      .8819886    1.017422
----------------------------------------------------------------

. svy:mean allow_mal_vaccine , over(v024)
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =      20                    Number of obs   =      5,181
Number of PSUs   =     200                    Population size = 51,809.999
                                              Design df       =        180

--------------------------------------------------------------------------
                         |             Linearized
                         |       Mean   Std. Err.     [95% Conf. Interval]
-------------------------+------------------------------------------------
c.allow_mal_vaccine@v024 |
                western  |   .8936196   .0166891      .8606881    .9265512
                central  |   .9199834   .0197888      .8809355    .9590313
          greater accra  |   .8290962   .0168497      .7958478    .8623446
                  volta  |   .8499737   .0151945      .8199915    .8799558
                eastern  |   .8973186   .0197149      .8584165    .9362208
                ashanti  |   .9576829   .0085518      .9408081    .9745576
            brong ahafo  |   .9657379   .0143135      .9374941    .9939817
               northern  |   .9440608   .0125213      .9193534    .9687681
             upper east  |   .9180704   .0197741      .8790515    .9570892
             upper west  |   .9086983    .015986      .8771542    .9402424
--------------------------------------------------------------------------

. svy:tab v024 s512, percent
(running tabulate on estimation sample)

Number of strata   =        20                  Number of obs     =      5,181
Number of PSUs     =       200                  Population size   = 51,809.999
                                                Design df         =        180

--------------------------------------------------
          |  allow child to be vaccinated against 
          |                malaria                
   region |       no       yes  don't kn     Total
----------+---------------------------------------
  western |    .7435     8.645     .2856     9.674
  central |    .4188     6.542     .1503     7.111
  greater |    1.476     15.01     1.618      18.1
    volta |    1.267      9.21     .3583     10.84
  eastern |    .8731     11.12     .3994     12.39
  ashanti |    .6128     17.57     .1635     18.34
 brong ah |    .1847     7.041     .0651     7.291
 northern |    .3857     8.773     .1341     9.293
 upper ea |    .3059     3.801     .0333      4.14
 upper we |    .2425     2.557     .0144     2.814
          | 
    Total |     6.51     90.27     3.222       100
--------------------------------------------------
  Key:  cell percentage

  Pearson:
    Uncorrected   chi2(18)        =  202.1814
    Design-based  F(13.51, 2431.65)=    7.1303    P = 0.0000

. svy:tab v024 allow_mal_vaccine , percent
(running tabulate on estimation sample)

Number of strata   =        20                  Number of obs     =      5,181
Number of PSUs     =       200                  Population size   = 51,809.999
                                                Design df         =        180

-------------------------------
          |   RECODE of s512   
          | (allow child to be 
          | vaccinated against 
          |      malaria)      
   region |    No    Yes  Total
----------+--------------------
  western | 1.029  8.645  9.674
  central |  .569  6.542  7.111
  greater | 3.094  15.01   18.1
    volta | 1.626   9.21  10.84
  eastern | 1.272  11.12  12.39
  ashanti | .7763  17.57  18.34
 brong ah | .2498  7.041  7.291
 northern | .5199  8.773  9.293
 upper ea | .3392  3.801   4.14
 upper we |  .257  2.557  2.814
          | 
    Total | 9.732  90.27    100
-------------------------------
  Key:  cell percentage

  Pearson:
    Uncorrected   chi2(9)         =  137.3456
    Design-based  F(7.86, 1414.76)=    9.5625     P = 0.0000

. do "C:\Users\hp\AppData\Local\Temp\STD308c_000000.tmp"

. drop allow_mal_vaccine

. 
end of do-file

. do "C:\Users\hp\AppData\Local\Temp\STD308c_000000.tmp"

. recode s512 (0 8 =0 "No") (1=1 "Yes"), gen (Allow_mal_vaccine)
(131 differences between s512 and Allow_mal_vaccine)

. 
end of do-file

. do "C:\Users\hp\AppData\Local\Temp\STD308c_000000.tmp"

. svy:mean Allow_mal_vaccine, over(v024)
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =      20                    Number of obs   =      5,181
Number of PSUs   =     200                    Population size = 51,809.999
                                              Design df       =        180

--------------------------------------------------------------------------
                         |             Linearized
                         |       Mean   Std. Err.     [95% Conf. Interval]
-------------------------+------------------------------------------------
c.Allow_mal_vaccine@v024 |
                western  |   .8936196   .0166891      .8606881    .9265512
                central  |   .9199834   .0197888      .8809355    .9590313
          greater accra  |   .8290962   .0168497      .7958478    .8623446
                  volta  |   .8499737   .0151945      .8199915    .8799558
                eastern  |   .8973186   .0197149      .8584165    .9362208
                ashanti  |   .9576829   .0085518      .9408081    .9745576
            brong ahafo  |   .9657379   .0143135      .9374941    .9939817
               northern  |   .9440608   .0125213      .9193534    .9687681
             upper east  |   .9180704   .0197741      .8790515    .9570892
             upper west  |   .9086983    .015986      .8771542    .9402424
--------------------------------------------------------------------------

. 
end of do-file

. save "C:\Users\hp\Documents\thesis\Ghana_2019_MIS_analysis_project\data\women_malaria.dta", replace
file C:\Users\hp\Documents\thesis\Ghana_2019_MIS_analysis_project\data\women_malaria.dta saved

. svy:mean allow_mal_vaccine , over(v024)
(running mean on estimation sample)
variable allow_mal_vaccine not found
r(111);

. svy:mean Allow_mal_vaccine , over(v024)
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =      20                    Number 
> of obs                                             
>          =      5,181
Number of PSUs   =     200                    Populat
> ion size                                           
>          = 51,809.999
                                              Design 
> df                                                 
>          =        180

-----------------------------------------------------
> ---------------------
                         |             Linearized
                         |       Mean   Std. Err.    
>  [95% Con                                          
>          f. Interval]
-------------------------+---------------------------
> ---------------------
c.Allow_mal_vaccine@v024 |
                western  |   .8936196   .0166891     
>  .8606881                                          
>              .9265512
                central  |   .9199834   .0197888     
>  .8809355                                          
>              .9590313
          greater accra  |   .8290962   .0168497     
>  .7958478                                          
>              .8623446
                  volta  |   .8499737   .0151945     
>  .8199915                                          
>              .8799558
                eastern  |   .8973186   .0197149     
>  .8584165                                          
>              .9362208
                ashanti  |   .9576829   .0085518     
>  .9408081                                          
>              .9745576
            brong ahafo  |   .9657379   .0143135     
>  .9374941                                          
>              .9939817
               northern  |   .9440608   .0125213     
>  .9193534                                          
>              .9687681
             upper east  |   .9180704   .0197741     
>  .8790515                                          
>              .9570892
             upper west  |   .9086983    .015986     
>  .8771542                                          
>              .9402424
-----------------------------------------------------
> ---------------------

. svy:mean Allow_mal_vaccine , over(v024)
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =      20                    Number of obs   =      5,181
Number of PSUs   =     200                    Population size = 51,809.999
                                              Design df       =        180

--------------------------------------------------------------------------
                         |             Linearized
                         |       Mean   Std. Err.     [95% Conf. Interval]
-------------------------+------------------------------------------------
c.Allow_mal_vaccine@v024 |
                western  |   .8936196   .0166891      .8606881    .9265512
                central  |   .9199834   .0197888      .8809355    .9590313
          greater accra  |   .8290962   .0168497      .7958478    .8623446
                  volta  |   .8499737   .0151945      .8199915    .8799558
                eastern  |   .8973186   .0197149      .8584165    .9362208
                ashanti  |   .9576829   .0085518      .9408081    .9745576
            brong ahafo  |   .9657379   .0143135      .9374941    .9939817
               northern  |   .9440608   .0125213      .9193534    .9687681
             upper east  |   .9180704   .0197741      .8790515    .9570892
             upper west  |   .9086983    .015986      .8771542    .9402424
--------------------------------------------------------------------------

. br b1
b1 ambiguous abbreviation
r(111);

. br b19
b19 ambiguous abbreviation
r(111);

. br b19_01

. br

. svy:tab v020
(running tabulate on estimation sample)

Number of strata   =        20                  Number of obs     =      5,181
Number of PSUs     =       200                  Population size   = 51,809.999
                                                Design df         =        180

----------------------
ever-marr |
ied       |
sample    | proportion
----------+-----------
 all woma |          1
----------------------
  Key:  proportion  =  cell proportion

  Only one row category.
  Statistics cannot be computed.

. svy:tab v020
(running tabulate on estimation sample)

Number of strata   =        20                  Number of obs     =      5,181
Number of PSUs     =       200                  Population size   = 51,809.999
                                                Design df         =        180

----------------------
ever-marr |
ied       |
sample    | proportion
----------+-----------
 all woma |          1
----------------------
  Key:  proportion  =  cell proportion

  Only one row category.
  Statistics cannot be computed.

. svy:tab v014 v012
(running tabulate on estimation sample)

Number of strata   =        20                  Number of obs     =      5,181
Number of PSUs     =       200                  Population size   = 51,809.999
                                                Design df         =        180

-------------------------------------------------------------------------------------------
completen |
ess of    |
age       |
informati |                            respondent's current age                            
on        |      15      16      17      18      19      20      21      22      23      24
----------+--------------------------------------------------------------------------------
 month an |   .0363    .041   .0309   .0326    .034   .0355   .0327   .0317   .0321   .0302
 month an |       0       0       0       0       0       0       0 1.5e-04       0       0
 year and | 5.3e-04 2.2e-04 8.5e-05 2.5e-04 5.9e-04   .0014 6.1e-04 5.3e-04 7.1e-04    .001
 age - ye | 2.3e-04 4.8e-04       0       0       0       0       0 1.6e-04 1.8e-04       0
          | 
    Total |   .0371   .0417    .031   .0328   .0346   .0369   .0333   .0325    .033   .0312
-------------------------------------------------------------------------------------------

-------------------------------------------------------------------------------------------
completen |
ess of    |
age       |
informati |                            respondent's current age                            
on        |      25      26      27      28      29      30      31      32      33      34
----------+--------------------------------------------------------------------------------
 month an |   .0419   .0307   .0378    .034   .0309   .0422   .0243   .0249   .0273   .0241
 month an |       0       0       0       0       0       0       0       0       0       0
 year and |   .0011 3.0e-05   .0012 6.2e-04 5.0e-04 9.5e-04 6.0e-05 7.5e-04 5.6e-04 5.2e-04
 age - ye |       0       0       0       0 1.5e-04       0       0 1.5e-04       0       0
          | 
    Total |    .043   .0307    .039   .0346   .0315   .0432   .0244   .0258   .0279   .0246
-------------------------------------------------------------------------------------------

-------------------------------------------------------------------------------------------
completen |
ess of    |
age       |
informati |                            respondent's current age                            
on        |      35      36      37      38      39      40      41      42      43      44
----------+--------------------------------------------------------------------------------
 month an |   .0313   .0308   .0245   .0267   .0165   .0296   .0144   .0224    .019   .0136
 month an | 1.2e-04       0       0       0       0       0       0       0       0       0
 year and |   .0013 8.0e-04 9.3e-04 7.0e-04 9.2e-04   .0034 8.2e-04   .0015    .001 7.7e-04
 age - ye | 3.1e-04       0 1.9e-04 4.4e-04       0 3.1e-04       0       0       0       0
          | 
    Total |    .033   .0316   .0256   .0278   .0174   .0333   .0152   .0239   .0201   .0144
-------------------------------------------------------------------------------------------

-----------------------------------------------------------
completen |
ess of    |
age       |
informati |            respondent's current age            
on        |      45      46      47      48      49   Total
----------+------------------------------------------------
 month an |   .0208   .0148    .015   .0169   .0154   .9671
 month an |       0       0       0       0       0 2.8e-04
 year and |   .0028 9.0e-04 3.2e-04 9.1e-04 5.1e-04   .0298
 age - ye |       0       0       0 2.3e-04       0   .0028
          | 
    Total |   .0236   .0157   .0154   .0181   .0159       1
-----------------------------------------------------------
  Key:  cell proportion

  Pearson:
    Uncorrected   chi2(102)       =  164.5244
    Design-based  F(31.14, 5604.55)=    1.6891    P = 0.0097

. inspect v014 v012

v014:  completeness of age information          Number of Observations
-------------------------------------- ---------------------------------------
                                             Total      Integers   Nonintegers
|  #                         Negative            -             -             -
|  #                         Zero                -             -             -
|  #                         Positive        5,181         5,181             -
|  #                                   -----------   -----------   -----------
|  #                         Total           5,181         5,181             -
|  #   .   .   .             Missing             -
+----------------------                -----------
1                     6                      5,181
   (4 unique values)

      v014 is labeled and all values are documented in the label.

v012:  respondent's current age                 Number of Observations
-------------------------------        ---------------------------------------
                                             Total      Integers   Nonintegers
|  #                         Negative            -             -             -
|  #   #                     Zero                -             -             -
|  #   #   #   #             Positive        5,181         5,181             -
|  #   #   #   #                       -----------   -----------   -----------
|  #   #   #   #   #         Total           5,181         5,181             -
|  #   #   #   #   #         Missing             -
+----------------------                -----------
15                   49                      5,181
  (35 unique values)

. codebook v014 v012

-----------------------------------------------------------------------------------------------
v014                                                            completeness of age information
-----------------------------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  V014

                 range:  [1,6]                        units:  1
         unique values:  4                        missing .:  0/5,181

            tabulation:  Freq.   Numeric  Label
                         4,965         1  month and year - information
                                          complete
                             2         2  month and age - year imputed
                           202         3  year and age - month imputed
                            12         6  age - year/month imputed

-----------------------------------------------------------------------------------------------
v012                                                                   respondent's current age
-----------------------------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [15,49]                      units:  1
         unique values:  35                       missing .:  0/5,181

                  mean:   29.6995
              std. dev:    9.6468

           percentiles:        10%       25%       50%       75%       90%
                                17        21        29        37        44

. br v014

. tab v014

      completeness of age information |      Freq.     Percent        Cum.
--------------------------------------+-----------------------------------
month and year - information complete |      4,965       95.83       95.83
         month and age - year imputed |          2        0.04       95.87
         year and age - month imputed |        202        3.90       99.77
             age - year/month imputed |         12        0.23      100.00
--------------------------------------+-----------------------------------
                                Total |      5,181      100.00

. tab v014, nolab

completenes |
   s of age |
information |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      4,965       95.83       95.83
          2 |          2        0.04       95.87
          3 |        202        3.90       99.77
          6 |         12        0.23      100.00
------------+-----------------------------------
      Total |      5,181      100.00

. label variable v012 "Respondent's current age"

. save "C:\Users\hp\Documents\thesis\Ghana_2019_MIS_analysis_project\data\women_malaria.dta", r
> eplace
file C:\Users\hp\Documents\thesis\Ghana_2019_MIS_analysis_project\data\women_malaria.dta saved

. tab v025

    type of |
   place of |
  residence |      Freq.     Percent        Cum.
------------+-----------------------------------
      urban |      2,440       47.10       47.10
      rural |      2,741       52.90      100.00
------------+-----------------------------------
      Total |      5,181      100.00

. tab v034
no observations

. tab v020

ever-married sample |      Freq.     Percent        Cum.
--------------------+-----------------------------------
   all woman sample |      5,181      100.00      100.00
--------------------+-----------------------------------
              Total |      5,181      100.00

. codebook v219 v220

-----------------------------------------------------------------------------------------------
v219                                                        living children + current pregnancy
-----------------------------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [0,13]                       units:  1
         unique values:  14                       missing .:  0/5,181

                  mean:   2.32677
              std. dev:   2.20423

           percentiles:        10%       25%       50%       75%       90%
                                 0         0         2         4         5

-----------------------------------------------------------------------------------------------
v220                                              living children + current pregnancy (grouped)
-----------------------------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  V220, but 6 nonmissing values are not labeled

                 range:  [0,6]                        units:  1
         unique values:  7                        missing .:  0/5,181

            tabulation:  Freq.   Numeric  Label
                         1,436         0  
                           834         1  
                           790         2  
                           671         3  
                           569         4  
                           394         5  
                           487         6  6+

. label variable v106 "Highest educational level"

. label variable v130 "Religion"

. label variable v131 "Ethnicity"

. label variable v136 "Number of househo
> ld members"

. label variable v137 "Number of childre
> n 5 and under in household"

. label variable s511 "Heard about malar
> ia vaccine"

. label variable v013 "Age in 5-year gro
> ups"

. label variable v220 "Living children"

. label variable v190 "Wealth quintile"

. save "C:\Users\hp\Documents\thesis\Gha
> na_2019_MIS_analysis_project\data\wome
> n_malaria.dta", replace
file C:\Users\hp\Documents\thesis\Ghana_
> 2019_MIS_analysis_project\data\women_m
> alaria.dta saved

. tab v220

     Living |
   children |      Freq.     Percent    
>     Cum.
------------+---------------------------
> --------
          0 |      1,436       27.72    
>    27.72
          1 |        834       16.10    
>    43.81
          2 |        790       15.25    
>    59.06
          3 |        671       12.95    
>    72.01
          4 |        569       10.98    
>    83.00
          5 |        394        7.60    
>    90.60
         6+ |        487        9.40    
>   100.00
------------+---------------------------
> --------
      Total |      5,181      100.00

. label variable v220 "Living_children"

. save "C:\Users\hp\Documents\thesis\Ghana_2019_MIS_analysis_project\data\women_malaria.dta", r
> eplace
file C:\Users\hp\Documents\thesis\Ghana_2019_MIS_analysis_project\data\women_malaria.dta saved

. tab v130

                Religion |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                catholic |        599       11.56       11.56
                anglican |         40        0.77       12.33
               methodist |        276        5.33       17.66
            presbyterian |        297        5.73       23.39
 pentecostal/charismatic |      1,981       38.24       61.63
         other christian |        692       13.36       74.99
                   islam |      1,095       21.13       96.12
traditional/spiritualist |         76        1.47       97.59
             no religion |        122        2.35       99.94
                   other |          3        0.06      100.00
-------------------------+-----------------------------------
                   Total |      5,181      100.00

. tab v106

     Highest |
 educational |
       level |      Freq.     Percent        Cum.
-------------+-----------------------------------
no education |      1,133       21.87       21.87
     primary |        960       18.53       40.40
   secondary |      2,732       52.73       93.13
      higher |        356        6.87      100.00
-------------+-----------------------------------
       Total |      5,181      100.00

. svy:tab v130
(running tabulate on estimation sample)

Number of strata   =        20                  Number of obs     =      5,181
Number of PSUs     =       200                  Population size   = 51,809.999
                                                Design df         =        180

----------------------
 Religion | proportion
----------+-----------
 catholic |      .0796
 anglican |      .0064
 methodis |      .0558
 presbyte |      .0625
 pentecos |      .4418
 other ch |      .1408
    islam |      .1821
 traditio |      .0107
 no relig |      .0196
    other |    7.2e-04
          | 
    Total |          1
----------------------
  Key:  proportion  =  cell proportion

. svy:tab v130
(running tabulate on estimation sample)

Number of strata   =        20                  Number of obs     =      5,181
Number of PSUs     =       200                  Population size   = 51,809.999
                                                Design df         =        180

----------------------
 Religion | proportion
----------+-----------
 catholic |      .0796
 anglican |      .0064
 methodis |      .0558
 presbyte |      .0625
 pentecos |      .4418
 other ch |      .1408
    islam |      .1821
 traditio |      .0107
 no relig |      .0196
    other |    7.2e-04
          | 
    Total |          1
----------------------
  Key:  proportion  =  cell proportion

. svy:tab v131
(running tabulate on estimation sample)

Number of strata   =        20                  Number of obs     =      5,181
Number of PSUs     =       200                  Population size   = 51,809.999
                                                Design df         =        180

----------------------
Ethnicity | proportion
----------+-----------
     akan |      .4404
 ga/dangm |      .0727
      ewe |      .1695
     guan |      .0215
 mole-dag |      .1772
    grusi |      .0313
    gurma |      .0527
    mande |       .009
    other |      .0256
          | 
    Total |          1
----------------------
  Key:  proportion  =  cell proportion

. svy:tab v131, no lab
(running tabulate on estimation sample)
option no not allowed
r(198);

. svy:tab v131 no lab
variable no not found
r(111);

. tab v131

   Ethnicity |      Freq.     Percent        Cum.
-------------+-----------------------------------
        akan |      1,958       37.79       37.79
   ga/dangme |        275        5.31       43.10
         ewe |        744       14.36       57.46
        guan |        119        2.30       59.76
mole-dagbani |      1,460       28.18       87.94
       grusi |        217        4.19       92.13
       gurma |        223        4.30       96.43
       mande |         49        0.95       97.38
       other |        136        2.62      100.00
-------------+-----------------------------------
       Total |      5,181      100.00

. tab v131, nolab

  Ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,958       37.79       37.79
          2 |        275        5.31       43.10
          3 |        744       14.36       57.46
          4 |        119        2.30       59.76
          5 |      1,460       28.18       87.94
          6 |        217        4.19       92.13
          7 |        223        4.30       96.43
          8 |         49        0.95       97.38
         96 |        136        2.62      100.00
------------+-----------------------------------
      Total |      5,181      100.00

. recode v131 (1 =1 "Akan") (3=2 "Ewe")  (2=3 "Ga/Dangme")(5= 4 "Mole-Dagbani") (4 6 7 8 96 = 4
>  "Other Ethnicities, gen (Ethnicity)
invalid varlist (rule)..: quotes do not match

r(198);

. recode v131 (1 =1 "Akan") (3=2 "Ewe")  (2=3 "Ga-Adangme")(5= 4 "Mole-Dagbani") (4 6 7 8 96 = 
> 4 "Other Ethnicities", gen (Ethnicity)
invalid varlist (rule)..: unmatched open parenthesis or bracket

r(198);

. recode v131 (1 =1 "Akan") (3=2 "Ewe")  (2=3 "Ga-Adangme")(5= 4 "Mole-Dagbani") (4 6 7 8 96 = 
> 4 "Other Ethnicities"), gen (Ethnicity)
(3104 differences between v131 and Ethnicity)

. tab Ethnicity

   RECODE of v131 |
      (Ethnicity) |      Freq.     Percent        Cum.
------------------+-----------------------------------
             Akan |      1,958       37.79       37.79
              Ewe |        744       14.36       52.15
       Ga-Adangme |        275        5.31       57.46
Other Ethnicities |      2,204       42.54      100.00
------------------+-----------------------------------
            Total |      5,181      100.00

. tab v131

   Ethnicity |      Freq.     Percent        Cum.
-------------+-----------------------------------
        akan |      1,958       37.79       37.79
   ga/dangme |        275        5.31       43.10
         ewe |        744       14.36       57.46
        guan |        119        2.30       59.76
mole-dagbani |      1,460       28.18       87.94
       grusi |        217        4.19       92.13
       gurma |        223        4.30       96.43
       mande |         49        0.95       97.38
       other |        136        2.62      100.00
-------------+-----------------------------------
       Total |      5,181      100.00

. drop Ethnicity

. recode v131 (1 =1 "Akan") (3=2 "Ewe")  (2=3 "Ga-Adangme")(5= 3 "Mole-Dagbani") (4 6 7 8 96 = 
> 4 "Other Ethnicities", gen (Ethnicity)
invalid varlist (rule)..: unmatched open parenthesis or bracket

r(198);

. recode v131 (1 =1 "Akan") (3=2 "Ewe")  (2=3 "Ga-Adangme")(5= 3 "Mole-Dagbani") (4 6 7 8 96 = 
> 4 "Other Ethnicities"), gen (Ethnicity)
(3104 differences between v131 and Ethnicity)

. tab Ethnicity

   RECODE of v131 |
      (Ethnicity) |      Freq.     Percent        Cum.
------------------+-----------------------------------
             Akan |      1,958       37.79       37.79
              Ewe |        744       14.36       52.15
     Mole-Dagbani |      1,735       33.49       85.64
Other Ethnicities |        744       14.36      100.00
------------------+-----------------------------------
            Total |      5,181      100.00

. drop Ethnicity

. recode v131 (1 =1 "Akan") (3=2 "Ewe")  (2=3 "Ga-Adangme")(5= 4 "Mole-Dagbani") (4 6 7 8 96 = 
> 5 "Other Ethnicities"), gen (Ethnicity)
(3223 differences between v131 and Ethnicity)

. tab Ethnicity

   RECODE of v131 |
      (Ethnicity) |      Freq.     Percent        Cum.
------------------+-----------------------------------
             Akan |      1,958       37.79       37.79
              Ewe |        744       14.36       52.15
       Ga-Adangme |        275        5.31       57.46
     Mole-Dagbani |      1,460       28.18       85.64
Other Ethnicities |        744       14.36      100.00
------------------+-----------------------------------
            Total |      5,181      100.00

. tab v131

   Ethnicity |      Freq.     Percent        Cum.
-------------+-----------------------------------
        akan |      1,958       37.79       37.79
   ga/dangme |        275        5.31       43.10
         ewe |        744       14.36       57.46
        guan |        119        2.30       59.76
mole-dagbani |      1,460       28.18       87.94
       grusi |        217        4.19       92.13
       gurma |        223        4.30       96.43
       mande |         49        0.95       97.38
       other |        136        2.62      100.00
-------------+-----------------------------------
       Total |      5,181      100.00

. save "C:\Users\hp\Documents\thesis\Ghana_2019_MIS_analysis_project\data\women_malaria.dta", r
> eplace
file C:\Users\hp\Documents\thesis\Ghana_2019_MIS_analysis_project\data\women_malaria.dta saved

. display 37.8+14.4+ 5.3+28.2+14.4
100.1

. display 37.8+14.4+ 5.3+28.1+14.4
100

. svy:tab Ethnicity
(running tabulate on estimation sample)

Number of strata   =        20                  Number of obs     =      5,181
Number of PSUs     =       200                  Population size   = 51,809.999
                                                Design df         =        180

----------------------
RECODE of |
v131      |
(Ethnicit |
y)        | proportion
----------+-----------
     Akan |      .4404
      Ewe |      .1695
 Ga-Adang |      .0727
 Mole-Dag |      .1772
 Other Et |      .1402
          | 
    Total |          1
----------------------
  Key:  proportion  =  cell proportion

. tab Ethnicity, percent
option percent not allowed
r(198);

. tab Ethnicity percent
variable percent not found
r(111);

. svy:tab Ethnicity, percent
(running tabulate on estimation sample)

Number of strata   =        20                  Number of obs     =      5,181
Number of PSUs     =       200                  Population size   = 51,809.999
                                                Design df         =        180

----------------------
RECODE of |
v131      |
(Ethnicit |
y)        | percentage
----------+-----------
     Akan |      44.04
      Ewe |      16.95
 Ga-Adang |       7.27
 Mole-Dag |      17.72
 Other Et |      14.02
          | 
    Total |        100
----------------------
  Key:  percentage  =  cell percentage

. svy:tab v131
(running tabulate on estimation sample)

Number of strata   =        20                  Number of obs     =      5,181
Number of PSUs     =       200                  Population size   = 51,809.999
                                                Design df         =        180

----------------------
Ethnicity | proportion
----------+-----------
     akan |      .4404
 ga/dangm |      .0727
      ewe |      .1695
     guan |      .0215
 mole-dag |      .1772
    grusi |      .0313
    gurma |      .0527
    mande |       .009
    other |      .0256
          | 
    Total |          1
----------------------
  Key:  proportion  =  cell proportion

. svy:tab Ethnicity, percent
(running tabulate on estimation sample)

Number of strata   =        20                  Number of obs     =      5,181
Number of PSUs     =       200                  Population size   = 51,809.999
                                                Design df         =        180

----------------------
RECODE of |
v131      |
(Ethnicit |
y)        | percentage
----------+-----------
     Akan |      44.04
      Ewe |      16.95
 Ga-Adang |       7.27
 Mole-Dag |      17.72
 Other Et |      14.02
          | 
    Total |        100
----------------------
  Key:  percentage  =  cell percentage

. svy:tab v131
(running tabulate on estimation sample)

Number of strata   =        20                  Number of obs     =      5,181
Number of PSUs     =       200                  Population size   = 51,809.999
                                                Design df         =        180

----------------------
Ethnicity | proportion
----------+-----------
     akan |      .4404
 ga/dangm |      .0727
      ewe |      .1695
     guan |      .0215
 mole-dag |      .1772
    grusi |      .0313
    gurma |      .0527
    mande |       .009
    other |      .0256
          | 
    Total |          1
----------------------
  Key:  proportion  =  cell proportion

. svy:tab Ethnicity, percent
(running tabulate on estimation sample)

Number of strata   =        20                  Number of obs     =      5,181
Number of PSUs     =       200                  Population size   = 51,809.999
                                                Design df         =        180

----------------------
RECODE of |
v131      |
(Ethnicit |
y)        | percentage
----------+-----------
     Akan |      44.04
      Ewe |      16.95
 Ga-Adang |       7.27
 Mole-Dag |      17.72
 Other Et |      14.02
          | 
    Total |        100
----------------------
  Key:  percentage  =  cell percentage

. svy:tab v131,percent
(running tabulate on estimation sample)

Number of strata   =        20                  Number of obs     =      5,181
Number of PSUs     =       200                  Population size   = 51,809.999
                                                Design df         =        180

----------------------
Ethnicity | percentage
----------+-----------
     akan |      44.04
 ga/dangm |       7.27
      ewe |      16.95
     guan |       2.15
 mole-dag |      17.72
    grusi |      3.134
    gurma |      5.272
    mande |      .9002
    other |      2.565
          | 
    Total |        100
----------------------
  Key:  percentage  =  cell percentage

. 44+17+7.3+17.7+14
44 is not a valid command name
r(199);

. display 44+17+7.3+17.7+14
100

. svy:tab Ethnicity, percent
(running tabulate on estimation sample)

Number of strata   =        20                  Number of 
> obs                                                     
>         =      5,181
Number of PSUs     =       200                  Population
>  size                                                   
>         = 51,809.999
                                                Design df 
>         =        180

----------------------
RECODE of |
v131      |
(Ethnicit |
y)        | percentage
----------+-----------
     Akan |      44.04
      Ewe |      16.95
 Ga-Adang |       7.27
 Mole-Dag |      17.72
 Other Et |      14.02
          | 
    Total |        100
----------------------
  Key:  percentage  =  cell percentage

. save "C:\Users\hp\Documents\thesis\Ghana_2019_MIS_analys
> is_project\data\women_malaria.dta", replace
file C:\Users\hp\Documents\thesis\Ghana_2019_MIS_analysis_
> project\data\women_malaria.dta saved

